{
  "backend/main.mo": "Motoko actor defining the backend canister with types for Disease and Animal, and functions to add/retrieve diseases and animals, plus a checkSymptoms query that filters diseases by species and matches symptoms.",
  "feature_evidence.json": "Feature evidence report documenting five camera-related features (capture button, photo storage, thumbnail display, full-size display, and permission handling) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including components, hooks, pages, types, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining an earth-tone OKLCH color system for light and dark modes, including primary, secondary, accent, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Animal Disease Detection App', and a root div that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with three routes (dashboard at '/', detection at '/detect', results at '/results') all wrapped in a Layout component.",
  "frontend/src/components/AnimalSymptomForm.tsx": "Form component with species selector, breed/age inputs, symptoms textarea, and integrated CameraCapture component that validates input, calls checkSymptoms mutation, saves detection with optional photo to history, and navigates to results page.",
  "frontend/src/components/CameraCapture.tsx": "Camera capture component using useCamera hook that opens a dialog with video preview, handles camera permissions and errors, provides capture/switch/retry controls, converts captured photos to base64 data URLs, and shows mobile-specific UI elements.",
  "frontend/src/components/DashboardStats.tsx": "Displays three stat cards showing total detections, common species, and common diseases with icons and counts from HistoryStats data.",
  "frontend/src/components/DetectionHistoryItem.tsx": "Renders a clickable card for a single detection record showing thumbnail/icon, species/breed info, timestamp, and top detected disease with badge.",
  "frontend/src/components/DiseaseResultCard.tsx": "Displays detailed disease information including severity badge, affected species, symptom checklist with matched symptoms highlighted, and treatment advice.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo and navigation links (Dashboard/New Detection), main content area, and footer with branding and social links.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDetectionHistory.ts": "Manages detection history in localStorage with photo compression (max 500KB), provides addDetection function and getStats for aggregating species/disease counts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for checking symptoms, adding diseases, and fetching disease data from the backend actor, with automatic query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom earth-tone color palette (greens, browns, oranges) for light and dark modes, plus base typography and utility styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying detection statistics and history list with navigation to new detections and past results.",
  "frontend/src/pages/DetectionPage.tsx": "Main detection page with feature highlights (instant analysis, accuracy, care advice) and the animal symptom input form.",
  "frontend/src/pages/ResultsPage.tsx": "Results page showing detection outcomes including animal photo, reported symptoms, matched symptoms, and potential diseases with treatment advice.",
  "frontend/src/types/detection.ts": "TypeScript interfaces for detection records (with animal details, symptoms, photo, and results) and history statistics.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, border radius variables, shadows, Inter font, and accordion animations.",
  "project_state.json": "Project metadata tracking implemented features (form input, results display, dashboard, camera capture, photo storage) and pending AI/ML integration requirements."
}